app/Views/user/news_sources.php

SELECT *
FROM `categories`
WHERE `categories`.`id` = '7'
---
                                        <?php
                                        // Accede a los datos de la categoría usando el modelo de categoría
                                        $categoryModel = model('App\Models\CategoryModel');
                                        $category = $categoryModel->find($newsSource['category_id']);