app/Controllers/AuthController.php

    public function login() {
        // Obtén los datos del formulario de inicio de sesión
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Instancia el modelo de usuarios
        $userModel = new UserModel();

        // Busca al usuario por su dirección de correo electrónico
        $userData = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'jmendezma@est.utn.ac.cr'
 LIMIT 1