app/Controllers/categoryController.php

    public function index(){
        $data['pageTitle'] = 'Categories';
        $data['showLogo'] = true;
        $categoryModel= model(CategoryModel::class);
        $data['categories'] = $categoryModel->findAll();
---
SELECT *
FROM `categories`

    public function edit($id){
        $categoryModel = model(CategoryModel::class);
        $data['categories'] = $categoryModel->where('id', $id)->first();
---
SELECT *
FROM `categories`
WHERE `id` = '7'
 LIMIT 1