app/Controllers/UserController.php

    public function index()
    {
        $categoryModel= model(CategoryModel::class);
        $data['categories'] = $categoryModel->findAll();

        $data['pageTitle'] = 'My News Cover';
        $data['showLogo'] = true;
        $newsSourcesModel= model(NewsSourcesModel::class);
        $data['news_sources'] = $newsSourcesModel->findAll();
---
SELECT *
FROM `categories`
SELECT *
FROM `news_sources`

    public function show_sources_input()
    {
        $categoryModel= model(CategoryModel::class);
        $data['categories'] = $categoryModel->findAll();

        $data['pageTitle'] = 'My News Cover';
        $data['showLogo'] = true;
        $newsSourcesModel= model(NewsSourcesModel::class);
        $data['news_sources'] = $newsSourcesModel->findAll();
---
SELECT *
FROM `categories`
SELECT *
FROM `news_sources`

    public function show_sources()
    {
        $categoryModel= model(CategoryModel::class);
        $data['categories'] = $categoryModel->findAll();

        $data['pageTitle'] = 'My News Cover';
        $data['showLogo'] = true;
        $newsSourcesModel= model(NewsSourcesModel::class);
        $data['news_sources'] = $newsSourcesModel->findAll();
---
SELECT *
FROM `categories`
SELECT *
FROM `news_sources`

    public function edit($id){
        $categoryModel= model(CategoryModel::class);
        $data['categories'] = $categoryModel->findAll();

        $newsSourcesModel = model(NewsSourcesModel::class);
        $data['newsSource'] = $newsSourcesModel->where('id', $id)->first();
---
SELECT *
FROM `categories`
SELECT *
FROM `news_sources`
WHERE `id` = '13'
 LIMIT 1